# Creating data structures

 - creates data series/data frames from lists, dictionaries and tuples
 - refactor indexes programatically 
 - concat data frames

In [1]:
import pandas as pd

#Series

data=[1,2,3,4,5]
type(data) #list

s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
index = ['line ' + str(i) for i in range(len(data))]
index

['line 0', 'line 1', 'line 2', 'line 3', 'line 4']

In [3]:
s = pd.Series(data = data, index= index)
s

line 0    1
line 1    2
line 2    3
line 3    4
line 4    5
dtype: int64

In [4]:
data = { 'line ' + str(i) : i + 1 for i in range(5) }
data

{'line 0': 1, 'line 1': 2, 'line 2': 3, 'line 3': 4, 'line 4': 5}

In [5]:
s = pd.Series(data)
s

line 0    1
line 1    2
line 2    3
line 3    4
line 4    5
dtype: int64

In [6]:
# adds 2 to all values in series

s1 = s + 2
s1

line 0    3
line 1    4
line 2    5
line 3    6
line 4    7
dtype: int64

# DataFrame

In [7]:
data = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

type(data)

list

In [8]:
df = pd.DataFrame(data = data)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
index = ['Line ' + str(i) for i in range(len(data))]
index

['Line 0', 'Line 1', 'Line 2']

In [10]:
df1 = pd.DataFrame(data= data, index = index)
df1

        0  1  2
Line 0  1  2  3
Line 1  4  5  6
Line 2  7  8  9

In [11]:
columns = ['Column ' + str(i) for i in range(len(data))]
columns

['Column 0', 'Column 1', 'Column 2']

In [12]:
df1 = pd.DataFrame(data = data, index=index, columns = columns)
df1

        Column 0  Column 1  Column 2
Line 0         1         2         3
Line 1         4         5         6
Line 2         7         8         9

In [13]:
data = {'Column 0': {'Line 0': 1, 'Line 1': 4, 'Line 2': 7},
 'Column 1': {'Line 0': 2, 'Line 1': 5, 'Line 2': 8},
 'Column 2': {'Line 0': 3, 'Line 1': 6, 'Line 2': 9}}
type(data)

dict

In [14]:
df2 = pd.DataFrame(data)
df2

        Column 0  Column 1  Column 2
Line 0         1         2         3
Line 1         4         5         6
Line 2         7         8         9

In [15]:
data = [
    (1,2,3),
    (3,4,5),
    (7,8,9)
]

type(data)

list

In [16]:
df3 = pd.DataFrame(data = data, index= index, columns=columns)
df3

        Column 0  Column 1  Column 2
Line 0         1         2         3
Line 1         3         4         5
Line 2         7         8         9

In [17]:
# Sets values due to given codition
df1[df1 > 0] = 'A'
df1

       Column 0 Column 1 Column 2
Line 0        A        A        A
Line 1        A        A        A
Line 2        A        A        A

In [18]:
df2[df2 > 0] = 'B'
df2

       Column 0 Column 1 Column 2
Line 0        B        B        B
Line 1        B        B        B
Line 2        B        B        B

In [19]:
df3[df3 > 0] = 'C'
df3

       Column 0 Column 1 Column 2
Line 0        C        C        C
Line 1        C        C        C
Line 2        C        C        C

In [20]:
concatDfs = pd.concat([df1, df2, df3])
concatDfs

       Column 0 Column 1 Column 2
Line 0        A        A        A
Line 1        A        A        A
Line 2        A        A        A
Line 0        B        B        B
Line 1        B        B        B
Line 2        B        B        B
Line 0        C        C        C
Line 1        C        C        C
Line 2        C        C        C

In [21]:
concatDfs = pd.concat([df1, df2, df3], axis = 1)
concatDfs

,Column 0,Column 1,Column 2,Column 0,Column 1,Column 2,Column 0,Column 1,Column 2
Line 0,A,A,A,B,B,B,C,C,C
Line 1,A,A,A,B,B,B,C,C,C
Line 2,A,A,A,B,B,B,C,C,C